In [1]:
import pandas as pd
import numpy as np

In [25]:
# data from dn.no and 
# http://fishpool.eu/price-information/spot-prices/weekly-details/

df_mowi_raw = pd.read_excel('mowi.xlsx', skiprows=[0,1])
df_salm_raw = pd.read_excel('SalMar.xlsx', skiprows=[0,1])
df_index = pd.read_excel('Weekly_details.xls', skiprows=[0])

Dato
2015-04-21    69.089592
2015-04-28    69.493840
2015-05-05    66.737606
2015-05-12    64.495869
2015-05-19    66.994855
Freq: W-TUE, Name: Siste, dtype: float64

In [26]:
df_mowi_raw.index = pd.to_datetime(df_mowi_raw['Dato'], infer_datetime_format=True)
df_mowi = df_mowi_raw['Siste'].resample('W-TUE').last().dropna()
df_salm_raw.index = pd.to_datetime(df_salm_raw['Dato'], infer_datetime_format=True)
df_salm = df_salm_raw['Siste'].resample('W-TUE').last().dropna()

# ref: Nasdaq Salmon Index is published every Tuesday.

In [31]:

df.head()

                Siste      Siste
Dato
2015-04-21  69.089592  89.873494
2015-04-28  69.493840  92.111008
2015-05-05  66.737606  89.500575
2015-05-12  64.495869  85.771384
2015-05-19  66.994855  89.127656

In [49]:
df_index = df_index[-len(df_salm.index):]
df_index.index = df_salm.index

In [52]:

df = pd.concat([df_mowi, df_salm], axis=1, join='outer').dropna()
df = pd.concat([df, df_index['FPI NOK']], axis=1, join='outer').dropna()
df.columns = ['df_mowi', 'df_salm', 'salmPrice']

In [53]:
df.to_csv('dataSalm.csv')

              df_mowi    df_salm  salmPrice
Dato
2015-04-21  69.089592  89.873494      41.18
2015-04-28  69.493840  92.111008      37.06
2015-05-05  66.737606  89.500575      35.89
2015-05-12  64.495869  85.771384      37.65
2015-05-19  66.994855  89.127656      35.69